def run_program():
    เลขพัสดุทั้งหมด = []
    while True:
        _in = input("กรุณาใส่เลขพัสดุของท่าน หรือ พิมพ์ x เพื่อออกจากโปรแกรม : ")
        if _in == "x":
            print("ขอขอบพระคุณที่ใช้บริการ")
            print("สรุปเลขพัสดุทั้งหมดที่ท่านได้ทำการ add ทั้งหมดมีดังนี้ {} ".format(str(เลขพัสดุทั้งหมด)))
            break
        
        else :
            print("ท่านได้ทำการเพิ่มเลขพัสดุ {} ลงในฐานข้อมูลเรียบร้อยแล้วคะ".format(_in))
            เลขพัสดุทั้งหมด.append(_in)
    return เลขพัสดุทั้งหมด
